src/Catalogs/ПрофильМониторинга/ПрофильМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофильМониторинга</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Онлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автообновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоТочек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСдвига</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяНастройка</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АнализПоказателейЧислоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗаголовкаТекущейТочки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЗаголовкаТекущейТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаждыйПоказательОтдельно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйШагОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтображенияПрофиляПриРотации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверкиВыпоненияФоновогоЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокПоказателей</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьНаДиаграмме</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомасштаб</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Масштаб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьДанныеЗаПрошлыйПериод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВременноеСмещение</name>
      <type>
        <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьТренд</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУсредняемыхЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЛинии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСглаживания</name>
      <type>
        <types>EnumRef.ТипыСглаживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаЛинии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиМониторинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаПоказателя</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Быстрый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиПоказателей</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыДиаграммАнализДиаграмм</name>
    <attributes>
      <name>ИдентификаторТипаПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПрофильМониторинга/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// <Описание функции>
//
// Параметры:
//  <ОбъектСсылка>	- <СправочникСсылка.ПрофильМониторинга> - ссылка на профиль мониторинга,
//					показатели которого необходимо получить
//  <Настройка>		- <УникальныйИдентификатор> - УИД настройки профиля, показатели которого
//					необходимо получить
//
// Возвращаемое значение:
//   <ТаблицаЗначений>
//
// Примечание:
//	
Функция ПолучитьПоказатели(ОбъектСсылка, Настройка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПрофильМониторингаПорядокПоказателей.Номер,
	|	ПрофильМониторингаПорядокПоказателей.ОтображатьНаДиаграмме,
	|	ПрофильМониторингаПорядокПоказателей.Автомасштаб,
	|	ПрофильМониторингаПорядокПоказателей.Масштаб,
	|	ПрофильМониторингаПорядокПоказателей.ПоказатьДанныеЗаПрошлыйПериод,
	|	ПрофильМониторингаПорядокПоказателей.ВременноеСмещение,
	|	ПрофильМониторингаПорядокПоказателей.ПоказыватьТренд,
	|	ПрофильМониторингаПорядокПоказателей.КоличествоУсредняемыхЗначений,
	|	ПрофильМониторингаПорядокПоказателей.ТипЛинии,
	|	ПрофильМониторингаПорядокПоказателей.ТипСглаживания,
	|	ПрофильМониторингаПорядокПоказателей.ТолщинаЛинии,
	|	ПрофильМониторингаПорядокПоказателей.Показатель
	|ИЗ
	|	Справочник.ПрофильМониторинга.ПорядокПоказателей КАК ПрофильМониторингаПорядокПоказателей
	|ГДЕ
	|	ПрофильМониторингаПорядокПоказателей.Ссылка = &Ссылка
	|	И ПрофильМониторингаПорядокПоказателей.НастройкаПоказателя = &НастройкаПоказателя
	|УПОРЯДОЧИТЬ ПО
	|	ПрофильМониторингаПорядокПоказателей.Номер
	|";
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("НастройкаПоказателя", Настройка);
    
    
	Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

Функция ПолучитьНастройки(ОбъектСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофильМониторингаНастройкиПоказателей.УИД КАК УИД,
		|	ПрофильМониторингаНастройкиПоказателей.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПрофильМониторинга.НастройкиПоказателей КАК ПрофильМониторингаНастройкиПоказателей
		|ГДЕ
		|	ПрофильМониторингаНастройкиПоказателей.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Настройки = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Настройка = Новый Структура;
		Настройка.Вставить("УИД", Выборка.УИД);
		Настройка.Вставить("Наименование", Выборка.Наименование);
		
		Настройки.Добавить(Настройка);
	КонецЦикла;
	
	Возврат Настройки;
КонецФункции

Функция РазобратьНавигационнуюСсылку(РезультатВвода) Экспорт
	ИмяСекцииНастройка = "?ref_set=";
	ИмяСекцииДата = "e1cib/data/";
	ИмяСекцииСсылка = "?ref=";
	
	Результат = Неопределено;
	
	НачалоСекцииНастройки = СтрНайти(РезультатВвода, ИмяСекцииНастройка);
	Если НачалоСекцииНастройки > 0 Тогда
		СсылкаНастройка = Сред(РезультатВвода, НачалоСекцииНастройки + СтрДлина(ИмяСекцииНастройка));
		
		РезультатВвода = Лев(РезультатВвода, НачалоСекцииНастройки - 1);
		
		НачалоСекцииДата = СтрНайти(РезультатВвода, ИмяСекцииДата);
		НачалоСекцииСсылки = СтрНайти(РезультатВвода, ИмяСекцииСсылка);
		
		Если НачалоСекцииДата > 0  И НачалоСекцииСсылки > 0 Тогда
			ПредставлениеТипа   = Сред(РезультатВвода, НачалоСекцииДата + СтрДлина(ИмяСекцииДата), НачалоСекцииСсылки - НачалоСекцииДата - СтрДлина(ИмяСекцииДата));
			ПредставлениеТипа = СтрЗаменить(ПредставлениеТипа, "Справочник.", "");
			ПустаяСсылка = ЗначениеВСтрокуВнутр(Справочники[ПредставлениеТипа].ПустаяСсылка());
			СсылкаСтрока = Сред(РезультатВвода, НачалоСекцииСсылки + СтрДлина(ИмяСекцииСсылка));
			СсылкаСтрока = СтрЗаменить(СсылкаСтрока, """", "");
			ЗначениеСсылки = СтрЗаменить(ПустаяСсылка, "00000000000000000000000000000000", СсылкаСтрока);
			СсылкаНаПрофиль = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
			
			Результат = Новый Структура;
			Результат.Вставить("СсылкаНаПрофиль", СсылкаНаПрофиль);
			Результат.Вставить("СсылкаНастройка", Новый УникальныйИдентификатор(СсылкаНастройка));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецЕсли
